# To run:
# brew tap homebrew/boneyard
# brew bundle Brewfile

# Make sure we’re using the latest Homebrew
# update

# Upgrade any already-brewed formulae
# upgrade

# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# Install some other useful utilities like `sponge`
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'
# Install Bash 4
brew 'bash'

# Install wget with IRI support
brew 'wget', args: ['with-iri']

# Install RingoJS and Narwhal
# Note that the order in which these are brewed is important; see http://git.io/brew-narwhal-ringo.
# brew 'ringojs'
# brew 'narwhal'

# Install more recent versions of some OS X tools
brew 'vim', args: [' --override-system-vi ']
brew 'homebrew/dupes/grep'
# brew josegonzalez/homebrew-php/php55

# This formula didn’t work well last time I tried it:
#brew homebrew/dupes/screen

# Install other useful binaries
brew 'ack'
brew 'pv'
#brew exiv2
brew 'git'
brew 'imagemagick' , args: ['with-webp']
# brew lynx
brew 'node'
brew 'pigz'
brew 'rename'
# brew rhino
brew 'tree'
# brew webkit2png
brew 'zopfli'
brew 'p7zip'

# brew homebrew/versions/lua52

brew 'cask'
brew 'tmux'
brew 'bash-completion'
brew 'lftp'
brew 'wget'
brew 'w3m'
brew 'unrar'
brew 'mutt'
brew 'the_silver_searcher'
brew 'colordiff'
brew 'erlang'
brew 'rebar'
brew 'ghostscript'
brew 'a2ps'
brew 'ocaml'
brew 'opam'
brew 'source-highlight'
brew 'fasd'
brew 'htop'

# Remove outdated versions from the cellar
# cleanup
